mentalibor/STM32f446RE_drivers/Src/stm32f44xx_usart.c
/******************************************************************************
** Copyright (c) 2021 Mentalibor. All rights reserved. Email: mentalibor@gmail.com
**
** Name
** stm32f44xx_usart.c
**
** Purpose
** USART/UART driver for the STM32F44XX
**
** Revision
** 08-Feb-2021 (Mentalibor) Initial version.
**
******************************************************************************/

#include "stm32f44xx_usart.h"

/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the USART/UART peripheral clock
 *
 * @param[in]   pUSARTx   	Reference to the USART/UART definition structure
 * @param[in]   EnorDi  	ENABLE/DISABLE macro
 *
 ******************************************************************************/
void USART_PeriClockControl	( USART_RegDef_t *pUSARTx
							, uint8_t EnorDi
							)
{
	if(EnorDi == ENABLE)
	{
		if(pUSARTx == USART1)
		{
			USART1_PCLK_EN();
		}
		else if (pUSARTx == USART2)
		{
			USART2_PCLK_EN();
		}
		else if (pUSARTx == USART3)
		{
			USART3_PCLK_EN();
		}
		else if (pUSARTx == UART4)
		{
			UART4_PCLK_EN();
		}
		else if (pUSARTx == UART5)
		{
			UART5_PCLK_EN();
		}
		else if (pUSARTx == USART6)
		{
			USART6_PCLK_EN();
		}
	}
	else
	{
		if(pUSARTx == USART1)
		{
			USART1_PCLK_DI();
		}
		else if (pUSARTx == USART2)
		{
			USART2_PCLK_DI();
		}
		else if (pUSARTx == USART3)
		{
			USART3_PCLK_DI();
		}
		else if (pUSARTx == UART4)
		{
			UART4_PCLK_DI();
		}
		else if (pUSARTx == UART5)
		{
			UART5_PCLK_DI();
		}
		else if (pUSARTx == USART6)
		{
			USART6_PCLK_DI();
		}
	}
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Initializes the USART/UART peripheral
 *
 * @param[in]   pUSARTHandle  Reference to the USART/UART handler
 *
 ******************************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle)
{
	uint32_t tempreg=0;


	USART_PeriClockControl(pUSARTHandle->pUSARTx, ENABLE);

	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		tempreg |= (1 << USART_CR1_RE);
	}
	else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		tempreg |= ( 1 << USART_CR1_TE );

	}
	else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		tempreg |= (1 << USART_CR1_TE);
		tempreg |= (1 << USART_CR1_RE);
	}

	tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M;


    //Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		tempreg |= ( 1 << USART_CR1_PCE);

	}
	else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		tempreg |= ( 1 << USART_CR1_PCE);

	    tempreg |= ( 1 << USART_CR1_PS);

	}


	pUSARTHandle->pUSARTx->CR1 = tempreg;

	tempreg = 0;

	tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits  << USART_CR2_STOP;

	pUSARTHandle->pUSARTx->CR2 = tempreg;

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		//enable CTS flow control
		tempreg |= ( 1 << USART_CR3_CTSE);


	}
	else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		//enable RTS flow control
		tempreg |= ( 1 << USART_CR3_RTSE);

	}
	else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		tempreg |= ( 1 << USART_CR3_CTSE);
		tempreg |= ( 1 << USART_CR3_RTSE);
	}

	pUSARTHandle->pUSARTx->CR3 = tempreg;

	USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Deinitializes the USART/UART peripheral
 *
 * @param[in]   pUSARTx  Reference to the USART/UART definition structure
 *
 ******************************************************************************/
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
	if (pUSARTx == USART1)
	{
		USART1_REG_RESET();
	}

	else if (pUSARTx == USART2)
	{
		USART2_REG_RESET();
	}

	else if (pUSARTx == USART3)
	{
		USART3_REG_RESET();
	}

	else if (pUSARTx == UART4)
	{
		UART4_REG_RESET();
	}

	else if (pUSARTx == UART5)
	{
		UART5_REG_RESET();
	}

	else if (pUSARTx == USART6)
	{
		USART6_REG_RESET();
	}
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Sends data in blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pTxbuffer		Reference to the TX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 ******************************************************************************/
void USART_SendData ( USART_Handle_t *pUSARTHandle
					, uint8_t *pTxBuffer
					, uint32_t Len
					)
{

	uint16_t *pdata;

	for(uint32_t i = 0 ; i < Len; i++)
	{
		//wait until TXE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TXE));

         //Check the USART_WordLength item for 9BIT or 8BIT in a frame
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//if 9BIT, load the DR with 2bytes masking the bits other than first 9 bits
			pdata = (uint16_t*) pTxBuffer;
			pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

			//check for USART_ParityControl
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used in this transfer. so, 9bits of user data will be sent
				pTxBuffer++;
				pTxBuffer++;
			}
			else
			{
				//Parity bit is used in this transfer . so , 8bits of user data will be sent
				//The 9th bit will be replaced by parity bit by the hardware
				pTxBuffer++;
			}
		}
		else
		{
			pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

			pTxBuffer++;
		}
	}

	//wait till TC flag is set in the SR
	while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TC));
}

