mentalibor/STM32f446RE_drivers/Src/stm32f44xx_usart.c
/*******************************************************************************
 * @ingroup api_usart
 * @brief Receives data in blocking mode
 *
 * @param[in]   pUSARTHandle  	Reference to the USART/UART handler
 * @param[in]	pRxbuffer		Reference to the RX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 ******************************************************************************/
void USART_ReceiveData	( USART_Handle_t *pUSARTHandle
						, uint8_t *pRxBuffer
						, uint32_t Len
						)
{
	for(uint32_t i = 0 ; i < Len; i++)
	{
		//wait until RXNE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_RXNE));

		//check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used. so, all 9bits will be of user data

				*((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

				pRxBuffer++;
				pRxBuffer++;
			}
			else
			{
				//Parity is used, so, 8bits will be of user data and 1 bit is parity
				 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

				 pRxBuffer++;
			}
		}
		else
		{
			//check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//read 8 bits from DR
				*pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
			}

			else
			{
				//read only 7 bits , hence mask the DR with 0X7F
				 *pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0x7F);

			}

			pRxBuffer++;
		}
	}

}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Sends data in non-blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pTxbuffer		Reference to the TX buffer
 * @param[in]	Len				Length of the TX buffer
 *
 * @return uint8_t
 * @retval USART_BUSY_IN_RX
 * @retval USART_BUSY_IN_TX
 * @retval USART_READY
 ******************************************************************************/
uint8_t USART_SendDataIT ( USART_Handle_t *pUSARTHandle
						 , uint8_t *pTxBuffer
						 , uint32_t Len
						 )
{
	uint8_t txstate = pUSARTHandle->TxBusyState;

	if(txstate != USART_BUSY_IN_TX)
	{
		pUSARTHandle->TxLen = Len;
		pUSARTHandle->pTxBuffer = pTxBuffer;
		pUSARTHandle->TxBusyState = USART_BUSY_IN_TX;

		//Implement the code to enable interrupt for TXE
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TXEIE);


		//Implement the code to enable interrupt for TC
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TCIE);


	}

	return txstate;

}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Receives data in non-blocking mode
 *
 * @param[in]   pUSARTHandle 	Reference to the USART/UART handler
 * @param[in]	pRxbuffer		Reference to the RX buffer
 * @param[in]	Len				Length of the RX buffer
 *
 * @return uint8_t
 * @retval USART_BUSY_IN_RX
 * @retval USART_BUSY_IN_TX
 * @retval USART_READY
 ******************************************************************************/
uint8_t USART_ReceiveDataIT ( USART_Handle_t *pUSARTHandle
							, uint8_t *pRxBuffer
							, uint32_t Len
							)
{
	uint8_t rxstate = pUSARTHandle->RxBusyState;

	if(rxstate != USART_BUSY_IN_RX)
	{
		pUSARTHandle->RxLen = Len;
		pUSARTHandle->pRxBuffer = pRxBuffer;
		pUSARTHandle->RxBusyState = USART_BUSY_IN_RX;

		//Implement the code to enable interrupt for RXNE
		pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_RXNEIE);

	}

	return rxstate;

}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the corresponding IRQ
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	EnorDi		Enable or disable macro
 *
 ******************************************************************************/
void USART_IRQInterruptConfig	( uint8_t IRQNumber
								, uint8_t EnorDi
								)
{
	if(EnorDi == ENABLE)
	{
		if(IRQNumber <= 31)
		{
			//program ISER0 register
			*NVIC_ISER0 |= ( 1 << IRQNumber );

		}else if(IRQNumber > 31 && IRQNumber < 64 ) //32 to 63
		{
			//program ISER1 register
			*NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 64 && IRQNumber < 96 )
		{
			//program ISER2 register //64 to 95
			*NVIC_ISER3 |= ( 1 << (IRQNumber % 64) );
		}
	}else
	{
		if(IRQNumber <= 31)
		{
			//program ICER0 register
			*NVIC_ICER0 |= ( 1 << IRQNumber );
		}else if(IRQNumber > 31 && IRQNumber < 64 )
		{
			//program ICER1 register
			*NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 6 && IRQNumber < 96 )
		{
			//program ICER2 register
			*NVIC_ICER3 |= ( 1 << (IRQNumber % 64) );
		}
	}
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Configures the IRQ priority
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	IRQPriority	IRQ priority
 *
 ******************************************************************************/
void USART_IRQPriorityConfig ( uint8_t IRQNumber
							 , uint32_t IRQPriority
							 )
{
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber %4 ;

	uint8_t shift_amount = ( 8 * iprx_section) + ( 8 - NO_PR_BITS_IMPLEMENTED) ;

	*(  NVIC_IPR_BASE_ADDR + iprx ) |=  ( IRQPriority << shift_amount );
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Handles the interrupt
 *
 * @param[in]   pUSARTHandle  Reference to the USART/UART handler
 *
 ******************************************************************************/
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{

	uint32_t temp1 , temp2;
	uint16_t *pdata;

	/*************************Check for TC flag ********************************************/

