mentalibor/STM32f446RE_drivers/Src/stm32f44xx_usart.c
	if(temp1  && temp2 )
	{
		//Implement the code to clear the CTS flag in SR
		pUSARTHandle->pUSARTx->SR &= ~(1 << USART_SR_CTS);

		//this interrupt is because of cts
		USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_CTS);
	}

	/*************************Check for IDLE detection flag ********************************************/

	//Implement the code to check the status of IDLE flag bit in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_IDLE);

	//Implement the code to check the state of IDLEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_IDLEIE);


	if(temp1 && temp2)
	{
		//Implement the code to clear the IDLE flag. Refer to the RM to understand the clear sequence
		pUSARTHandle->pUSARTx->SR &= ~(1 << USART_SR_IDLE);
		//this interrupt is because of idle
		USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_IDLE);
	}

	/*************************Check for Overrun detection flag ********************************************/

	//Implement the code to check the status of ORE flag  in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & USART_SR_ORE;

	//Implement the code to check the status of RXNEIE  bit in the CR1
	temp2 = pUSARTHandle->pUSARTx->CR1 & USART_CR1_RXNEIE;


	if(temp1  && temp2 )
	{
		//Need not to clear the ORE flag here, instead give an api for the application to clear the ORE flag .

		//this interrupt is because of Overrun error
		USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_ORE);
	}



	/*************************Check for Error Flag ********************************************/

	//Noise Flag, Overrun error and Framing Error in multibuffer communication
	//We dont discuss multibuffer communication in this course. please refer to the RM
	//The blow code will get executed in only if multibuffer mode is used.

	temp2 =  pUSARTHandle->pUSARTx->CR3 & ( 1 << USART_CR3_EIE) ;

	if(temp2 )
	{
		temp1 = pUSARTHandle->pUSARTx->SR;
		if(temp1 & ( 1 << USART_SR_FE))
		{
			/*
		This bit is set by hardware when a de-synchronization, excessive noise or a break character
		is detected. It is cleared by a software sequence (an read to the USART_SR register
		followed by a read to the USART_DR register).
			 */
			USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_FE);
		}

		if(temp1 & ( 1 << USART_SR_NE) )
		{
			/*
		This bit is set by hardware when noise is detected on a received frame. It is cleared by a
		software sequence (an read to the USART_SR register followed by a read to the
		USART_DR register).
			 */
			USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_NE);
		}

		if(temp1 & ( 1 << USART_SR_ORE) )
		{
			USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_ORE);
		}
	}
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Sets the baudrate of the USART/UART peripheral
 *
 * @param[in]   pUSARTx  	Reference to the USART/UART definition structure
 * @param[in]	BaudRate	Baudrate value
 *
 ******************************************************************************/
void USART_SetBaudRate	( USART_RegDef_t *pUSARTx
						, uint32_t BaudRate
						)
{
	//Variable to hold the APB clock
	uint32_t PCLKx;

	uint32_t usartdiv;

	//variables to hold Mantissa and Fraction values
	uint32_t M_part,F_part;

	uint32_t tempreg=0;

	//Get the value of APB bus clock in to the variable PCLKx
	if(pUSARTx == USART1 || pUSARTx == USART6)
	{
	   //USART1 and USART6 are hanging on APB2 bus
	   PCLKx = RCC_GetPCLK2Value();
	}
	else
	{
	   PCLKx = RCC_GetPCLK1Value();
	}

	//Check for OVER8 configuration bit
	if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
	{
	   //OVER8 = 1 , over sampling by 8
	   usartdiv = ((25 * PCLKx) / (2 *BaudRate));
	}
	else
	{
	   //over sampling by 16
		usartdiv = ((25 * PCLKx) / (4 *BaudRate));
	}

	//Calculate the Mantissa part
	M_part = usartdiv/100;

	//Place the Mantissa part in appropriate bit position . refer USART_BRR
	tempreg |= M_part << 4;

	//Extract the fraction part
	F_part = (usartdiv - (M_part * 100));

	//Calculate the final fractional
	if(pUSARTx->CR1 & ( 1 << USART_CR1_OVER8))
	{
	  //OVER8 = 1 , over sampling by 8
	  F_part = ((( F_part * 8)+ 50) / 100)& ((uint8_t)0x07);

	}
	else
	{
	   //over sampling by 16
	   F_part = ((( F_part * 16)+ 50) / 100) & ((uint8_t)0x0F);

	}

	//Place the fractional part in appropriate bit position . refer USART_BRR
	tempreg |= F_part;

	//copy the value of tempreg in to BRR register
	pUSARTx->BRR = tempreg;
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Enables or disables the USART/UART peripheral
 *
 * @param[in]   pUSARTx  	Reference to the USART/UART definition structure
 * @param[in]   EnorDi  	ENABLE/DISABLE macro
 *
 ******************************************************************************/
void USART_PeripheralControl ( USART_RegDef_t *pUSARTx
							 , uint8_t EnOrDi
							 )
{
	if(EnOrDi == ENABLE)
	{
		pUSARTx->CR1 |= (1 << USART_CR1_UE);
	}else
	{
		pUSARTx->CR1 &= ~(1 << USART_CR1_UE);
	}
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Gets flag status from the SR register
 *
 * @param[in]   pUSARTx   	Reference to the USART/UART definition structure
 * @param[in]   FlagName   	flag name
 *
 * @return uint8_t
 * @retval FLAG_SET
 * @retval FLAG_RESET
 ******************************************************************************/
uint8_t USART_GetFlagStatus	( USART_RegDef_t *pUSARTx
							, uint32_t FlagName
							)
{
	if(pUSARTx->SR & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Clears the flag in SR register
 *
 * @param[in]   pUSARTx 		Reference to the USART/UART definition structure
 * @param[in]  	StatusFlagName	Name of flag macro
 *
 ******************************************************************************/
void USART_ClearFlag	( USART_RegDef_t *pUSARTx
						, uint16_t StatusFlagName
						)
{
	pUSARTx->SR &= ~(1 << StatusFlagName);
}

/*******************************************************************************
 * @ingroup api_usart
 * @brief Application event callback function
 *
 * @param[in]   pUSARTHandle  	Reference to the USART/UART handler
 * @param[in]   AppEv  			application event macro
 *
 ******************************************************************************/
__attribute__((weak)) void USART_ApplicationEventCallback	( USART_Handle_t *pUSARTHandle
															, uint8_t AppEv
															)
{
	/* This is a week implementation. The application may override this function. */
}
